Autodesk.Revit.DB.IExportContextProxy.OnLight(Autodesk.Revit.DB.LightNode)
This method marks the beginning of export of a light object.
node:
A node describing the light object.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnRPC(Autodesk.Revit.DB.RPCNode)
This method marks the beginning of export of an RPC object.
node:
A node with asset information about the RPC object.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnFaceBegin(Autodesk.Revit.DB.FaceNode)
This method marks the beginning of a Face to be exported
Remarks:
Note that this method (as well as OnFaceEnd) is invoked only if the custom
exporter was set up to include geometric objects in the output stream.
See Autodesk.Revit.DB.CustomExporter.IncludeGeometricObjects for mode details.
node:
An output node that represents a Face.
Returns:
Return RenderNodeAction. Proceed if you wish to receive geometry (polymesh)
for this face, or return RenderNodeAction.Skip otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnInstanceEnd(Autodesk.Revit.DB.InstanceNode)
This method marks the end of a family instance being exported
node:
An output node that represents a family instance.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnInstanceBegin(Autodesk.Revit.DB.InstanceNode)
This method marks the beginning of a family instance to be exported
Returns:
Return RenderNodeAction.Skip if you wish to skip processing this family instance,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of an element being exported
elementId:
The Id of the element that has just been processed
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnElementBegin(Autodesk.Revit.DB.ElementId)
This method marks the beginning of an element to be exported
elementId:
The Id of the element that is about to be processed
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this element,
or return RenderNodeAction.Proceed otherwise.
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnViewEnd(Autodesk.Revit.DB.ElementId)
This method marks the end of a 3D view being exported
elementId:
The Id of the 3D view that has just been processed
Since:
2014

Autodesk.Revit.DB.IExportContextProxy.OnViewBegin(Autodesk.Revit.DB.ViewNode)
This method marks the beginning of a 3D view to be exported
node:
Geometry node associated with the view
Returns:
Return RenderNodeAction.Skip if you wish to skip exporting this view,
or return RenderNodeAction.Proceed otherwise.
Since:
2014